grevaillot/svd_tools/headers/STM32H7x5_CM7/i2c1.h
/** I2C1_OAR1_OA1EN Own Address 1 enable **/
#define I2C1_OAR1_OA1EN		(1 << 15)
/** I2C1_OAR1_OA1MODE Own Address 1 10-bit mode Note: This bit can be written only when OA1EN=0. **/
#define I2C1_OAR1_OA1MODE		(1 << 10)

#define I2C1_OAR1_OA1_SHIFT		0
#define I2C1_OAR1_OA1_MASK		0x3ff
/** @defgroup i2c1_oar1_oa1 OA1 Interface address 7-bit addressing mode: dont care 10-bit addressing mode: bits 9:8 of address Note: These bits can be written only when OA1EN=0. OA1[7:1]: Interface address Bits 7:1 of address Note: These bits can be written only when OA1EN=0. OA1[0]: Interface address 7-bit addressing mode: dont care 10-bit addressing mode: bit 0 of address Note: This bit can be written only when OA1EN=0.
@{*/
/**@}*/


/**@}*/

/** @defgroup i2c1_oar2 OAR2 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK.
@{*/

/** I2C1_OAR2_OA2EN Own Address 2 enable **/
#define I2C1_OAR2_OA2EN		(1 << 15)

#define I2C1_OAR2_OA2MSK_SHIFT		8
#define I2C1_OAR2_OA2MSK_MASK		0x07
/** @defgroup i2c1_oar2_oa2msk OA2MSK Own Address 2 masks Note: These bits can be written only when OA2EN=0. As soon as OA2MSK is not equal to 0, the reserved I2C addresses (0b0000xxx and 0b1111xxx) are not acknowledged even if the comparison matches.
@{*/
/**@}*/


#define I2C1_OAR2_OA2_SHIFT		1
#define I2C1_OAR2_OA2_MASK		0x7f
/** @defgroup i2c1_oar2_oa2 OA2 Interface address bits 7:1 of address Note: These bits can be written only when OA2EN=0.
@{*/
/**@}*/


/**@}*/

/** @defgroup i2c1_timingr TIMINGR Access: No wait states
@{*/


#define I2C1_TIMINGR_PRESC_SHIFT		28
#define I2C1_TIMINGR_PRESC_MASK		0x0f
/** @defgroup i2c1_timingr_presc PRESC Timing prescaler This field is used to prescale I2CCLK in order to generate the clock period tPRESC used for data setup and hold counters (refer to I2C timings on page9) and for SCL high and low level counters (refer to I2C master initialization on page24). tPRESC = (PRESC+1) x tI2CCLK
@{*/
/**@}*/


#define I2C1_TIMINGR_SCLDEL_SHIFT		20
#define I2C1_TIMINGR_SCLDEL_MASK		0x0f
/** @defgroup i2c1_timingr_scldel SCLDEL Data setup time This field is used to generate a delay tSCLDEL between SDA edge and SCL rising edge. In master mode and in slave mode with NOSTRETCH = 0, the SCL line is stretched low during tSCLDEL. tSCLDEL = (SCLDEL+1) x tPRESC Note: tSCLDEL is used to generate tSU:DAT timing.
@{*/
/**@}*/


#define I2C1_TIMINGR_SDADEL_SHIFT		16
#define I2C1_TIMINGR_SDADEL_MASK		0x0f
/** @defgroup i2c1_timingr_sdadel SDADEL Data hold time This field is used to generate the delay tSDADEL between SCL falling edge and SDA edge. In master mode and in slave mode with NOSTRETCH = 0, the SCL line is stretched low during tSDADEL. tSDADEL= SDADEL x tPRESC Note: SDADEL is used to generate tHD:DAT timing.
@{*/
/**@}*/


#define I2C1_TIMINGR_SCLH_SHIFT		8
#define I2C1_TIMINGR_SCLH_MASK		0xff
/** @defgroup i2c1_timingr_sclh SCLH SCL high period (master mode) This field is used to generate the SCL high period in master mode. tSCLH = (SCLH+1) x tPRESC Note: SCLH is also used to generate tSU:STO and tHD:STA timing.
@{*/
/**@}*/


#define I2C1_TIMINGR_SCLL_SHIFT		0
#define I2C1_TIMINGR_SCLL_MASK		0xff
/** @defgroup i2c1_timingr_scll SCLL SCL low period (master mode) This field is used to generate the SCL low period in master mode. tSCLL = (SCLL+1) x tPRESC Note: SCLL is also used to generate tBUF and tSU:STA timings.
@{*/
/**@}*/


/**@}*/

/** @defgroup i2c1_timeoutr TIMEOUTR Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK.
@{*/

/** I2C1_TIMEOUTR_TEXTEN Extended clock timeout enable **/
#define I2C1_TIMEOUTR_TEXTEN		(1 << 31)

#define I2C1_TIMEOUTR_TIMEOUTB_SHIFT		16
#define I2C1_TIMEOUTR_TIMEOUTB_MASK		0xfff
/** @defgroup i2c1_timeoutr_timeoutb TIMEOUTB Bus timeout B This field is used to configure the cumulative clock extension timeout: In master mode, the master cumulative clock low extend time (tLOW:MEXT) is detected In slave mode, the slave cumulative clock low extend time (tLOW:SEXT) is detected tLOW:EXT= (TIMEOUTB+1) x 2048 x tI2CCLK Note: These bits can be written only when TEXTEN=0.
@{*/
/**@}*/

/** I2C1_TIMEOUTR_TIMOUTEN Clock timeout enable **/
#define I2C1_TIMEOUTR_TIMOUTEN		(1 << 15)
/** I2C1_TIMEOUTR_TIDLE Idle clock timeout detection Note: This bit can be written only when TIMOUTEN=0. **/
#define I2C1_TIMEOUTR_TIDLE		(1 << 12)

#define I2C1_TIMEOUTR_TIMEOUTA_SHIFT		0
#define I2C1_TIMEOUTR_TIMEOUTA_MASK		0xfff
/** @defgroup i2c1_timeoutr_timeouta TIMEOUTA Bus Timeout A This field is used to configure: The SCL low timeout condition tTIMEOUT when TIDLE=0 tTIMEOUT= (TIMEOUTA+1) x 2048 x tI2CCLK The bus idle condition (both SCL and SDA high) when TIDLE=1 tIDLE= (TIMEOUTA+1) x 4 x tI2CCLK Note: These bits can be written only when TIMOUTEN=0.
@{*/
/**@}*/


/**@}*/

/** @defgroup i2c1_isr ISR Access: No wait states
@{*/


#define I2C1_ISR_ADDCODE_SHIFT		17
#define I2C1_ISR_ADDCODE_MASK		0x7f
/** @defgroup i2c1_isr_addcode ADDCODE Address match code (Slave mode) These bits are updated with the received address when an address match event occurs (ADDR = 1). In the case of a 10-bit address, ADDCODE provides the 10-bit header followed by the 2 MSBs of the address.
@{*/
/**@}*/

/** I2C1_ISR_DIR Transfer direction (Slave mode) This flag is updated when an address match event occurs (ADDR=1). **/
#define I2C1_ISR_DIR		(1 << 16)
/** I2C1_ISR_BUSY Bus busy This flag indicates that a communication is in progress on the bus. It is set by hardware when a START condition is detected. It is cleared by hardware when a Stop condition is detected, or when PE=0. **/
#define I2C1_ISR_BUSY		(1 << 15)
/** I2C1_ISR_ALERT SMBus alert This flag is set by hardware when SMBHEN=1 (SMBus host configuration), ALERTEN=1 and a SMBALERT event (falling edge) is detected on SMBA pin. It is cleared by software by setting the ALERTCF bit. Note: This bit is cleared by hardware when PE=0. If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C1_ISR_ALERT		(1 << 13)
/** I2C1_ISR_TIMEOUT Timeout or tLOW detection flag This flag is set by hardware when a timeout or extended clock timeout occurred. It is cleared by software by setting the TIMEOUTCF bit. Note: This bit is cleared by hardware when PE=0. If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C1_ISR_TIMEOUT		(1 << 12)
/** I2C1_ISR_PECERR PEC Error in reception This flag is set by hardware when the received PEC does not match with the PEC register content. A NACK is automatically sent after the wrong PEC reception. It is cleared by software by setting the PECCF bit. Note: This bit is cleared by hardware when PE=0. If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C1_ISR_PECERR		(1 << 11)
/** I2C1_ISR_OVR Overrun/Underrun (slave mode) This flag is set by hardware in slave mode with NOSTRETCH=1, when an overrun/underrun error occurs. It is cleared by software by setting the OVRCF bit. Note: This bit is cleared by hardware when PE=0. **/
#define I2C1_ISR_OVR		(1 << 10)
/** I2C1_ISR_ARLO Arbitration lost This flag is set by hardware in case of arbitration loss. It is cleared by software by setting the ARLOCF bit. Note: This bit is cleared by hardware when PE=0. **/
#define I2C1_ISR_ARLO		(1 << 9)
/** I2C1_ISR_BERR Bus error This flag is set by hardware when a misplaced Start or Stop condition is detected whereas the peripheral is involved in the transfer. The flag is not set during the address phase in slave mode. It is cleared by software by setting BERRCF bit. Note: This bit is cleared by hardware when PE=0. **/
#define I2C1_ISR_BERR		(1 << 8)
/** I2C1_ISR_TCR Transfer Complete Reload This flag is set by hardware when RELOAD=1 and NBYTES data have been transferred. It is cleared by software when NBYTES is written to a non-zero value. Note: This bit is cleared by hardware when PE=0. This flag is only for master mode, or for slave mode when the SBC bit is set. **/
#define I2C1_ISR_TCR		(1 << 7)
/** I2C1_ISR_TC Transfer Complete (master mode) This flag is set by hardware when RELOAD=0, AUTOEND=0 and NBYTES data have been transferred. It is cleared by software when START bit or STOP bit is set. Note: This bit is cleared by hardware when PE=0. **/
#define I2C1_ISR_TC		(1 << 6)
/** I2C1_ISR_STOPF Stop detection flag This flag is set by hardware when a Stop condition is detected on the bus and the peripheral is involved in this transfer: either as a master, provided that the STOP condition is generated by the peripheral. or as a slave, provided that the peripheral has been addressed previously during this transfer. It is cleared by software by setting the STOPCF bit. Note: This bit is cleared by hardware when PE=0. **/
#define I2C1_ISR_STOPF		(1 << 5)
/** I2C1_ISR_NACKF Not Acknowledge received flag This flag is set by hardware when a NACK is received after a byte transmission. It is cleared by software by setting the NACKCF bit. Note: This bit is cleared by hardware when PE=0. **/
#define I2C1_ISR_NACKF		(1 << 4)
/** I2C1_ISR_ADDR Address matched (slave mode) This bit is set by hardware as soon as the received slave address matched with one of the enabled slave addresses. It is cleared by software by setting ADDRCF bit. Note: This bit is cleared by hardware when PE=0. **/
#define I2C1_ISR_ADDR		(1 << 3)
/** I2C1_ISR_RXNE Receive data register not empty (receivers) This bit is set by hardware when the received data is copied into the I2C_RXDR register, and is ready to be read. It is cleared when I2C_RXDR is read. Note: This bit is cleared by hardware when PE=0. **/
#define I2C1_ISR_RXNE		(1 << 2)
/** I2C1_ISR_TXIS Transmit interrupt status (transmitters) This bit is set by hardware when the I2C_TXDR register is empty and the data to be transmitted must be written in the I2C_TXDR register. It is cleared when the next data to be sent is written in the I2C_TXDR register. This bit can be written to 1 by software when NOSTRETCH=1 only, in order to generate a TXIS event (interrupt if TXIE=1 or DMA request if TXDMAEN=1). Note: This bit is cleared by hardware when PE=0. **/
#define I2C1_ISR_TXIS		(1 << 1)
/** I2C1_ISR_TXE Transmit data register empty (transmitters) This bit is set by hardware when the I2C_TXDR register is empty. It is cleared when the next data to be sent is written in the I2C_TXDR register. This bit can be written to 1 by software in order to flush the transmit data register I2C_TXDR. Note: This bit is set by hardware when PE=0. **/
#define I2C1_ISR_TXE		(1 << 0)

/**@}*/

